#### AirFanType Enumeration

---

|  |
| --- |
| See Also |

The type of air fan.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum AirFanType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AirFanType ``` |

| Visual C++ |
| --- |
| ``` public enum class AirFanType ``` |

# Members

| Member name | Description |
| --- | --- |
| ConstantVolume |  |
| VariableVolume |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace